/* Label for the password field in the account preferences */
"Password:" = "Password:";

/* No comment provided by engineer. */
"The characters you're entering are not valid for an account name on this service." = "The characters you're entering are not valid for an account name on this service.";

